# Advanced Programming M22.CS 505 Assignment 2

### Bicycle data Analysis by Ciniso Msibi

#### 1. Create a data frame df for the data set

In [1]:
import requests
import lxml.html as lh
import pandas as pd

In [3]:
bicycle = 'https://www.worldometers.info/bicycles/'
page = requests.get(bicycle)
doc = lh.fromstring(page.content)
tr_elements = doc.xpath('//tr')
[len(T) for T in tr_elements[:12]]

[3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3]

In [4]:
tr_elements = doc.xpath('//tr')
col = []
i = 0

for t in tr_elements[0]:
    i+=1
    name = t.text_content()
    print("%d:%s" % (i,name))
    col.append((name,[]))

1:Country
2:Quantity
3:Year

In [8]:
for j in range(1,len(tr_elements)):
    T = tr_elements[j]
    
    if len(T)!=3:
        break
        
    i = 0
    
    for t in T.iterchildren():
        data = t.text_content()
        col[i][1].append(data)
        
        i+= 1

In [9]:
[len(C) for (title,C) in col]

[50, 50, 50]

In [11]:
Dict = {title:column for(title,column) in col}
#creating the data frame
df = pd.DataFrame(Dict)

#### 2. Display the first five records in the data set.

In [12]:
df.head(5)

   Country       Quantity  Year
0         Â
1    China   450,000,000   1992
2      USA   100,000,000   1995
3    Japan    72,540,000   1996
4  Germany    62,000,000   1996

#### 3. Display the last six records in the data set.

In [13]:
df.tail(6)

        Country     Quantity  Year
44       Denmark  4,500,000   1995
45  Switzerland   3,800,000   1996
46      Hungary    3,500,000  1995
47     Australia  3,300,000   1995
48      Finland   3,250,000   1995
49       Norway   3,000,000   1995

#### 4. Delete row at index 0, since it contains Null values

In [16]:
df = df.iloc[1: , :]

In [17]:
df.head(5)

   Country       Quantity  Year
1    China   450,000,000   1992
2      USA   100,000,000   1995
3    Japan    72,540,000   1996
4  Germany    62,000,000   1996
5    India    30,800,000   1990

#### 5. Convert Quantity and Year features data types to float and int respectively

In [35]:
# Removing the commas from string in column Quantity
df['Quantity'] = df['Quantity'].str.replace(',','')

In [44]:
# convert data types
convert_data_types = {'Quantity': str,'Year': int}
df = df.astype(convert_data_types)

In [45]:
print(df.dtypes)

Country     object
Quantity    object
Year         int32
dtype: object

### 6. Use the following commands to displays the numbers of rows and columns in the data set.

In [46]:
df.shape

(49, 3)